app/controllers/recipes_controller.rb

  def index
    @recipe = Recipe.all.order("created_at DESC")
---
SELECT "recipes".* FROM "recipes" ORDER BY created_at DESC

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is my first recipe"], ["description", "pappapa apapapap apap"], ["created_at", 2017-02-26 16:22:56 UTC], ["updated_at", 2017-02-26 16:22:56 UTC]]

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "recipes"."id" = ?  [["image_updated_at", 2017-03-05 13:30:39 UTC], ["updated_at", 2017-03-05 13:30:39 UTC], ["image_file_name", "full_cevapi.jpg"], ["id", 4]]